shrec/UltrafastSecp256k1/examples/esp32p4_bench_hornet/sdkconfig.defaults
# Target: ESP32-P4 (RISC-V dual-core, HP core 360 MHz)
CONFIG_IDF_TARGET="esp32p4"

# Optimizer - performance for accurate benchmarks
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# Stack sizes (crypto needs more stack)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=65536
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=8192

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Logging
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# IPC task stack
CONFIG_ESP_IPC_TASK_STACK_SIZE=8192

# Disable IDLE watchdog (long benchmarks)
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
# Note: P4 requires SMP mode (UNICORE=y causes startup assert failure)
